var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "陈宇帆",
    sex: "男",
    age: "21",
    phone: "17362658676",
    email: "202212701@stu.neu.edu.cn",
    college: "东北大学",
    qq: "12234214321",
    log: "汤汁小白菜",
    excpect_work: "硕士",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "明天不一定会更好，但要坚信更好的明天一定会来。",
        "要做的事情总找得出时间和机会，不愿意做的事情也总能找得出借口。",
        "Gor For It!",
        "有智者立长志，无志者长立志。",
        // "那些过去的眼泪终将风干在记忆里。",
        "真相，是为了剿灭幻想。",
        "我欲将心向明月，奈何明月照沟渠。",
        "春风得意马蹄疾，一日看尽长安花。",
        // "天凉好个秋！",
        "老骥伏枥，志在千里。烈士暮年，壮心不已。",
        "老当益壮，宁移白首之心。穷且益坚，不坠青云之志。",
        "我们必须拿我们所有的， 去换我们所没有的",
        "蒹葭苍苍，白露为霜；所谓伊人，在水一方。",
        "数风流人物，还看今朝！"
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "青青子衿，悠悠我心<br>" +
             "但为君故，沉吟至今<br>" +
             "你好，我是陈宇帆，东北大学计算机科学与技术大三在读生<br>" +
             "很高兴见到你!",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about: "<p>你好！我叫陈宇帆，性别男，东北大学计算机科学与技术大三在读生。我期望我未来的科学研究在贵校展开。</p>" +
        "<p>我有着较多的数据挖掘与模式匹配的科研经验，计算机基础知识掌握扎实，能够在学习中很好的完成自己的任务。此外，我有着充满激情的工作态度，团队协同作战能力强，同时我也具备独立开发的能力，擅于发现并解决问题。我的执行力强、责任感高、集体荣誉感强、敢于担当，能够接受加班或出差等安排</p>" +
        "<p>十分期待与您的联系!</p>",



    /** 
    * 在这里配置你的技能点
    * ["技能点", 掌握程度, "技能条颜色"]
    */  
    skills: [
        ["概率论与数理统计", 100, "red"],
        ["离散数学", 99, "blue"],
        ["数据结构", 96, "#1abc9c"],
        ["汇编语言", 96, "rgba(0,0,0)"],
        ["数据库", 96, "yellow"],
        ["操作系统", 95, "pink"]
    ],


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>操作系统、计算机网络等编程基础知识良好。</li>" +
        "     <li>熟练掌握Java基础。</li>" +
        "     <li>熟悉C++、多线程、STL等基础框架。</li>" +
        // "     <li>了解JVM原理。</li>" +
        "     <li>熟悉SQL数据库设计。</li>" +
        "     <li>熟悉基本Linux命令操作。</li>" +
        "     <li>熟悉Spring boot的使用。</li>" +
        "     <li>了解Hadoop分布式系统的设计与应用。</li>" +
        " </ul>",


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["./images/pro-1.jpg", "https://cyfblogsite.xin/", "个人博客", "这里记录了我遇到的问题与解决方法"],
        ["./images/M2M.jpg","https://github.com/BioLab310/M2M","M2M", "M2M: Subgraph Matching Based on Minimum Spanning Tree and Candidate Graph"],
        ["./images/gTRFinder.jpg", "https://github.com/BioLab310/gTRFinder", "gTRFinder", "gTRFinder: A De Bruijn Graph Based Tandem Repeat Finder for Accurate Genomic Detection"]

        // ["./images/pro-2.png", "https://github.com/happysnaker/Gobang", "智能人机对战五子棋", "采用C++编写的智能五子棋人机对战<br>2021/7/23"],
        // ["https://pic3.zhimg.com/80/v2-d9766956d5c85c2780e4c5008fd946ca_1440w.jpg", "https://github.com/happysnaker/StudentsManageSystem", "学生管理系统", "C语言+AVL树+多重双向表实现"]
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

        ["2024.11", "<br>亚太大学生数学建模二等奖",
            "<p><strong>中国宠物市场发展趋势与国际政策的影响</strong></p>" +
            "<ul>" +
                "<li>全球宠物食品市场呈现地域性供需割裂（中国产能过剩vs欧美高端市场垄断），传统需求预测模型忽视政策冲击与跨国博弈，导致企业出海战略缺乏量化依据。</li>" +
                "<li>构建融合市场需求预测-供应链博弈-政策效应评估的决策系统，指导中国厂商产能规划与出口策略优化。</li>"+
                "<li>采用混合预测框架，使用Ridge 回归模型与时间序列模型分别预测了中国产量与国外宠物市场的需求量， 引入纳什均衡理论，构架中外食品倾销博弈模型，通过KKT条件求解中国与国外宠物食品的最优销售策略，以此计算中国未来三年宠物食品对外销量和生产量。设计DID双重差分模型，以2018年中美贸易战为政策冲击时点，量化关税壁垒对出口额的影响。 </li>"+
                "<li>担任团队代码编写，完成3类模型（预测/博弈/DID）核心模块的开发，为宠物食品市场提供战略分析工具。</li>"+
            "</ul>"
        ]
        ,
        ["2024.09", "<br>全国大学生数学建模省一等奖",
            "<p><strong>碎片化耕地下的农作物种植优化模型</strong></p>" +
            "<ul>"+
                "<li>传统种植规划模型忽视市场需求动态性与作物间互补效应，导致产量过剩或销量不足，亟需数据驱动的决策工具。 </li>"+
                "<li>构建融合价格波动、需求弹性与种植约束的随机规划模型，实现种植结构动态优化。</li>"+
                "<li>以农作物利润为优化目标，建立最大目标规划模型，设计非线性约束松弛技术，将作物互补性约束等非线性约束线性化，使NP-hard问题可通过线性求解器求解。</li>"+
                "<li>模型输出的轮种方案确保农场年均销售利润下限提升至592万元（较历史经验方案提升23.6%）。</li>"+
            "</ul>"
        ]
    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2023-11", "国家励志奖学金", "./images/2022国励志.jpg"],
        ["2024-11", "国家励志奖学金", "./images/2023国励志.jpg"],
        ["2024-05", "东北大学优秀团员", "./images/2023优秀团员.jpg"],
        ["2024-11", "东北大学三好学生", "./images/2023三好学生.jpg"]
    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     * 建议您放置数量 <= 5
     */
    icon: [
        ["./svg/LeetCode.svg", "https://leetcode.cn/u/practical-thompsonxhd/", "我的力扣主页"],
        ["./svg/github.svg", "https://github.com/c3f15f6/", "我的GitHub主页"],
        ["./svg/博客.svg", "https://cyfblogsite.xin/about/", "我的个人博客"]
        // ["./svg/掘金.svg", "https://juejin.cn/user/3853167638625000", "我的掘金主页"],
        // ["./svg/知乎.svg", "https://www.zhihu.com/people/tian-xia-you-dao-81", "我的知乎主页"]
    ],


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "./images/2.jpg",
        "./images/work-bk.jpg",
        "./images/4.jpg"
    ]

}
